/******************************************************************************

                  版权所有 (C), 2001-2015, 杭州海康威视数字技术股份有限公司

 ******************************************************************************
  文 件 名   : countDown_LaiSi.h
  版 本 号   : 初稿
  作    者   : 肖文虎
  生成日期   : 2015年4月2日
  最近修改   :
  功能描述   : countDown_LaiSi.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2015年4月2日
    作    者   : 肖文虎
    修改内容   : 创建文件

******************************************************************************/

#ifndef __COUNTDOWN_LAISI_H__
#define __COUNTDOWN_LAISI_H__


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "HikConfig.h"
#include "platform.h"
#include "parse_ini.h"
#include "countDown.h"
#include "common.h"

#ifdef __cplusplus
extern "C"{
#endif /* __cplusplus */


/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
#define MAX_NUM_COUNTDOWN_LAISI   16
#define MAX_NUM_PHASE       16

/*----------------------------------------------*
 * 类型重定义以及结构体定义                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 接口函数                                    *
 *----------------------------------------------*/
extern void LaiSiCountDownRun();

#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif /* __COUNTDOWN_LAISI_H__ */
